InformationRegisters/СостоянияВакансий.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>СостоянияВакансий</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Состояние</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СостоянияВакансии</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Вакансия</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Вакансии</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/СостоянияВакансий/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныйПрограммныйИнтерфейс

#Область ОбработчикиПравилРегистрации

// См. ЗарплатаКадрыРасширенныйСинхронизацияДанных.ШаблонОбработчика
Процедура ПриЗаполненииНастроекОбработчиковПравилРегистрации(Настройки) Экспорт
	ЗарплатаКадрыРасширенныйСинхронизацияДанных.ДляНезависимогоРегистра(Настройки, "Вакансия",
		"ПодборПерсонала");
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ТекущееСостояниеВакансий(Вакансии) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Вакансии", Вакансии);
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	СостоянияВакансий.Период,
		|	СостоянияВакансий.Вакансия,
		|	СостоянияВакансий.Состояние
		|ИЗ
		|	РегистрСведений.СостоянияВакансий.СрезПоследних(, Вакансия В (&Вакансии)) КАК СостоянияВакансий";
	ТаблицаРезультат = Запрос.Выполнить().Выгрузить();
	
	Соответствие = Новый Соответствие;
	Для Каждого СтрокаТаблицы Из ТаблицаРезультат Цикл
		Соответствие.Вставить(СтрокаТаблицы.Вакансия, ОбщегоНазначения.СтрокаТаблицыЗначенийВСтруктуру(СтрокаТаблицы));
	КонецЦикла;
	
	Возврат Соответствие;
	
КонецФункции

Процедура ПодготовитьОбновлениеЗависимыхДанныхПриОбменеПередЗаписью(Объект) Экспорт
	СохранитьПрежнийНаборЗаписей(Объект);
КонецПроцедуры

Процедура ПодготовитьОбновлениеЗависимыхДанныхПриОбменеПриЗаписи(Объект) Экспорт
	
	Если ОбщегоНазначения.ПодсистемаСуществует("ЗарплатаКадрыКорпоративнаяПодсистемы.ПодборПерсонала.АналитикаДанных") Тогда
		МодульПодборПерсоналаАналитикаДанных = ОбщегоНазначения.ОбщийМодуль("ПодборПерсоналаАналитикаДанных");
		МодульПодборПерсоналаАналитикаДанных.ЗаполнитьТаблицуОбновленияСостоянийВакансий(Объект);
	КонецЕсли;
	
КонецПроцедуры

Процедура СохранитьПрежнийНаборЗаписей(Объект) Экспорт
	
	Отбор = Объект.Отбор;
	Если Не Отбор.Вакансия.Использование Или Не ЗначениеЗаполнено(Отбор.Вакансия.Значение) Тогда
		Возврат;
	КонецЕсли;
		
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Вакансия", Отбор.Вакансия.Значение);
	Запрос.УстановитьПараметр("БезОтбораПоПериоду", Не Отбор.Период.Использование);
	Запрос.УстановитьПараметр("Период", Отбор.Период.Значение);
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ДанныеНабора.Период КАК Период,
		|	ДанныеНабора.Вакансия КАК Вакансия,
		|	ДанныеНабора.Состояние КАК Состояние
		|ИЗ
		|	РегистрСведений.СостоянияВакансий КАК ДанныеНабора
		|ГДЕ
		|	ДанныеНабора.Вакансия = &Вакансия
		|	И (&БезОтбораПоПериоду
		|	ИЛИ ДанныеНабора.Период = &Период)";
	
	Объект.ДополнительныеСвойства.Вставить("ПрежнийНабор", Запрос.Выполнить().Выгрузить());
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
